{"data":{"allStrapiJobs":{"nodes":[{"strapiId":1,"company":"Dolomite","date":"March 2020 - Present","position":"Software Engineer","desc":[{"id":1,"name":"Dolomite is a U.S. based decentralized cryptocurrency exchange based out of Metuchen, New Jersey."},{"id":2,"name":"Developed with React to create an order detail page of all historical fills on Dolomite [stats.dolomite.io/fills]."},{"id":3,"name":"Currently working on various frontend improvements and some backend stuff with the hummingbot API & web3j."}]},{"strapiId":2,"company":"Sony R&D","date":"August 2020 - November 2020","position":"Software Engineering Internship","desc":[{"id":4,"name":"Coded with Swift and React in an agile, sprint environment to make a next-generation networking application for college students around the country."},{"id":5,"name":"Collaborated with a fantastic development team in Japan and project leaders in San Mateo, California."},{"id":6,"name":"Helped recruit students at Lehigh and other schools to be `host students`, who are on-call for prospective students to reach out to."}]},{"strapiId":3,"company":"Ecomedes","date":"May 2020 - August 2020","position":"Software Development Internship","desc":[{"id":7,"name":"Ecomedes is a software startup which aims to conglomerate a wide variety of environmentally sustainable products into a user-friendly, interactive database."},{"id":8,"name":"Had the amazing opportunity to intern with Ecomedes in conjunction with the NASDAQ Entrepreneurial Center in San Francisco."},{"id":9,"name":"Integrated a PostgreSQL backend through express.js & node into a Next.js driven frontend to provide insights about user activity on various company platforms."}]},{"strapiId":4,"company":"Lehigh University","date":"July 2019 - Present","position":"Involvement","desc":[{"id":10,"name":"Working as a Junior Systems Administrator in Lehigh's SunLab. Regulating many important university processes, exploring low-level computation from a software and hardware perspective. Working with various Linux operating systems and UNIX machines."},{"id":11,"name":"TA'd for over five courses, including being Head TA of over 200 students for CSE 262 Programming Languages in the fall of 2020."},{"id":13,"name":"Founder, former President, and current Academic Chair of Lehigh's largest C.S. organization, the Coders' Community (300+ students). Current Technical Development Chair of the Computer Science & Business associaton. "},{"id":12,"name":"Serving as a CSB freshman mentor, started in April of 2020. Helping out 40+ new CSBs find their way!"}]}]}}}